<a href="https://colab.research.google.com/github/plthiyagu/Personnel/blob/master/Summarising%2C_Aggregating%2C_and_Grouping_data_in_Python_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import dateutil

In [2]:
df =pd.read_csv("https://raw.githubusercontent.com/plthiyagu/Personnel/master/Dataset/phone_data.csv")
df.tail()

     index            date  duration  item    month   network network_type
825    825  13/03/15 00:38     1.000   sms  2015-03     world        world
826    826  13/03/15 00:39     1.000   sms  2015-03  Vodafone       mobile
827    827  13/03/15 06:58    34.429  data  2015-03      data         data
828    828  14/03/15 00:13     1.000   sms  2015-03     world        world
829    829  14/03/15 00:16     1.000   sms  2015-03     world        world

In [3]:
df.dtypes

index             int64
date             object
duration        float64
item             object
month            object
network          object
network_type     object
dtype: object

In [4]:
# Convert date from string to date times
df['date'] = df['date'].apply(dateutil.parser.parse, dayfirst=True)

In [5]:
df.head()

   index                date  duration  item    month   network network_type
0      0 2014-10-15 06:58:00    34.429  data  2014-11      data         data
1      1 2014-10-15 06:58:00    13.000  call  2014-11  Vodafone       mobile
2      2 2014-10-15 14:46:00    23.000  call  2014-11    Meteor       mobile
3      3 2014-10-15 14:48:00     4.000  call  2014-11     Tesco       mobile
4      4 2014-10-15 17:27:00     4.000  call  2014-11     Tesco       mobile

In [6]:
df.dtypes

index                    int64
date            datetime64[ns]
duration               float64
item                    object
month                   object
network                 object
network_type            object
dtype: object

In [7]:
# How many rows the dataset
df['item'].count()

830

In [8]:
# What was the longest phone call / data entry?
df['duration'][df['item'] == 'call'].sum()

92321.0

In [9]:
# What was the longest phone call / data entry?
df['duration'].max()

10528.0

In [10]:
# How many entries are there for each month?
df['month'].value_counts()

2014-11    230
2015-01    205
2014-12    157
2015-02    137
2015-03    101
Name: month, dtype: int64

In [11]:
# Number of non-null unique network entries
df['network'].nunique()

9

In [14]:
df.groupby(['month']).groups.keys()

dict_keys(['2014-11', '2014-12', '2015-01', '2015-02', '2015-03'])

In [13]:
len(df.groupby(['month']).groups['2014-11'])

230

In [16]:
# Get the first entry for each month
df.groupby('month').first()

         index                date  duration  item   network network_type
month
2014-11      0 2014-10-15 06:58:00    34.429  data      data         data
2014-12    228 2014-11-13 06:58:00    34.429  data      data         data
2015-01    381 2014-12-13 06:58:00    34.429  data      data         data
2015-02    577 2015-01-13 06:58:00    34.429  data      data         data
2015-03    729 2015-02-12 20:15:00    69.000  call  landline     landline

In [17]:
# Get the sum of the durations per month
df.groupby('month')['duration'].sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [18]:
# Get the number of dates / entries in each month
df.groupby('month')['date'].count()

month
2014-11    230
2014-12    157
2015-01    205
2015-02    137
2015-03    101
Name: date, dtype: int64

In [19]:
# What is the sum of durations, for calls only, to each network
df[df['item'] == 'call'].groupby('network')['duration'].sum()

network
Meteor        7200.0
Tesco        13828.0
Three        36464.0
Vodafone     14621.0
landline     18433.0
voicemail     1775.0
Name: duration, dtype: float64

In [20]:
# How many calls, sms, and data entries are in each month?
df.groupby(['month', 'item'])['date'].count()

month    item
2014-11  call    107
         data     29
         sms      94
2014-12  call     79
         data     30
         sms      48
2015-01  call     88
         data     31
         sms      86
2015-02  call     67
         data     31
         sms      39
2015-03  call     47
         data     29
         sms      25
Name: date, dtype: int64

In [21]:
# How many calls, texts, and data are sent per month, split by network_type?
df.groupby(['month', 'network_type'])['date'].count()

month    network_type
2014-11  data             29
         landline          5
         mobile          189
         special           1
         voicemail         6
2014-12  data             30
         landline          7
         mobile          108
         voicemail         8
         world             4
2015-01  data             31
         landline         11
         mobile          160
         voicemail         3
2015-02  data             31
         landline          8
         mobile           90
         special           2
         voicemail         6
2015-03  data             29
         landline         11
         mobile           54
         voicemail         4
         world             3
Name: date, dtype: int64

In [22]:
# produces Pandas Series
df.groupby('month')['duration'].sum() 
# Produces Pandas DataFrame
df.groupby('month')[['duration']].sum()

          duration
month
2014-11  26639.441
2014-12  14641.870
2015-01  18223.299
2015-02  15522.299
2015-03  22750.441

In [23]:
df.groupby('month', as_index=False).agg({"duration": "sum"})

     month   duration
0  2014-11  26639.441
1  2014-12  14641.870
2  2015-01  18223.299
3  2015-02  15522.299
4  2015-03  22750.441

In [30]:
# Group the data frame by month and item and extract a number of stats from each group
df.groupby(
   ['month', 'item']
).agg(
    {
         'duration':sum,    # Sum duration per group
         'network_type': "count",  # get the count of networks
         'date': 'first'  # get the first date per group
    }
)

               duration  network_type            date
month   item
2014-11 call  25547.000           107  15/10/14 06:58
        data    998.441            29  15/10/14 06:58
        sms      94.000            94  16/10/14 22:18
2014-12 call  13561.000            79  14/11/14 17:24
        data   1032.870            30  13/11/14 06:58
        sms      48.000            48  14/11/14 17:28
2015-01 call  17070.000            88  15/12/14 20:03
        data   1067.299            31  13/12/14 06:58
        sms      86.000            86  15/12/14 19:56
2015-02 call  14416.000            67  15/01/15 10:36
        data   1067.299            31  13/01/15 06:58
        sms      39.000            39  15/01/15 12:23
2015-03 call  21727.000            47  12/02/15 20:15
        data    998.441            29  13/02/15 06:58
        sms      25.000            25  19/02/15 18:46

In [32]:
# Define the aggregation procedure outside of the groupby operation
from datetime import datetime, timedelta
aggregations = {
    'duration':'sum',
    'date': lambda x: max(x) - timedelta(days=1)
}
df.groupby('month').agg(aggregations)

          duration                date
month
2014-11  26639.441 2014-11-12 22:31:00
2014-12  14641.870 2014-12-13 19:54:00
2015-01  18223.299 2015-01-13 23:36:00
2015-02  15522.299 2015-02-11 06:58:00
2015-03  22750.441 2015-03-13 00:16:00

In [27]:
# Group the data frame by month and item and extract a number of stats from each group
df.groupby(
    ['month', 'item']
).agg(
    {
        # Find the min, max, and sum of the duration column
        'duration': [min, max, sum],
        # find the number of network type entries
        'network_type': "count",
        # minimum, first, and number of unique dates
        'date': [min, 'first', 'nunique']
    }
)

             duration             ...                date
                  min        max  ...               first nunique
month   item                      ...
2014-11 call    1.000   1940.000  ... 2014-10-15 06:58:00     104
        data   34.429     34.429  ... 2014-10-15 06:58:00      29
        sms     1.000      1.000  ... 2014-10-16 22:18:00      79
2014-12 call    2.000   2120.000  ... 2014-11-14 17:24:00      76
        data   34.429     34.429  ... 2014-11-13 06:58:00      30
        sms     1.000      1.000  ... 2014-11-14 17:28:00      41
2015-01 call    2.000   1859.000  ... 2014-12-15 20:03:00      84
        data   34.429     34.429  ... 2014-12-13 06:58:00      31
        sms     1.000      1.000  ... 2014-12-15 19:56:00      58
2015-02 call    1.000   1863.000  ... 2015-01-15 10:36:00      67
        data   34.429     34.429  ... 2015-01-13 06:58:00      31
        sms     1.000      1.000  ... 2015-01-15 12:23:00      27
2015-03 call    2.000  10528.000  ... 2015-02-12 20:15:00      47
        data   34.429     34.429  ... 2015-02-13 06:58:00      29
        sms     1.000      1.000  ... 2015-02-19 18:46:00      17

[15 rows x 7 columns]

In [34]:
# Group the data frame by month and item and extract a number of stats from each group
df.groupby(
    ['month', 'item']
).agg(
    {
        # Find the min, max, and sum of the duration column
        'duration': [min, max, sum],
        # find the number of network type entries
        'network_type': "count",
        # minimum, first, and number of unique dates
        'date': [min, 'first', 'nunique']
    }
)

             duration             ...                date
                  min        max  ...               first nunique
month   item                      ...
2014-11 call    1.000   1940.000  ... 2014-10-15 06:58:00     104
        data   34.429     34.429  ... 2014-10-15 06:58:00      29
        sms     1.000      1.000  ... 2014-10-16 22:18:00      79
2014-12 call    2.000   2120.000  ... 2014-11-14 17:24:00      76
        data   34.429     34.429  ... 2014-11-13 06:58:00      30
        sms     1.000      1.000  ... 2014-11-14 17:28:00      41
2015-01 call    2.000   1859.000  ... 2014-12-15 20:03:00      84
        data   34.429     34.429  ... 2014-12-13 06:58:00      31
        sms     1.000      1.000  ... 2014-12-15 19:56:00      58
2015-02 call    1.000   1863.000  ... 2015-01-15 10:36:00      67
        data   34.429     34.429  ... 2015-01-13 06:58:00      31
        sms     1.000      1.000  ... 2015-01-15 12:23:00      27
2015-03 call    2.000  10528.000  ... 2015-02-12 20:15:00      47
        data   34.429     34.429  ... 2015-02-13 06:58:00      29
        sms     1.000      1.000  ... 2015-02-19 18:46:00      17

[15 rows x 7 columns]

In [35]:
df[df['item'] == 'call'].groupby('month').agg(
    # Get max of the duration column for each group
    max_duration=('duration', max),
    # Get min of the duration column for each group
    min_duration=('duration', min),
    # Get sum of the duration column for each group
    total_duration=('duration', sum),
    # Apply a lambda to date column
    num_days=("date", lambda x: (max(x) - min(x)).days)    
)

         max_duration  min_duration  total_duration  num_days
month
2014-11        1940.0           1.0         25547.0        28
2014-12        2120.0           2.0         13561.0        30
2015-01        1859.0           2.0         17070.0        30
2015-02        1863.0           1.0         14416.0        25
2015-03       10528.0           2.0         21727.0        19

In [36]:
df[df['item'] == 'call'].groupby('month').agg(
    max_duration=pd.NamedAgg(column='duration', aggfunc=max),
    min_duration=pd.NamedAgg(column='duration', aggfunc=min),
    total_duration=pd.NamedAgg(column='duration', aggfunc=sum),
    num_days=pd.NamedAgg(
        column="date", 
        aggfunc=lambda x: (max(x) - min(x)).days)    
)

         max_duration  min_duration  total_duration  num_days
month
2014-11        1940.0           1.0         25547.0        28
2014-12        2120.0           2.0         13561.0        30
2015-01        1859.0           2.0         17070.0        30
2015-02        1863.0           1.0         14416.0        25
2015-03       10528.0           2.0         21727.0        19

In [39]:
grouped = df.groupby('month').agg("duration": [min, max, mean])

grouped.columns = grouped.columns.droplevel(level=0)
grouped.rename(columns={
    "min": "min_duration", "max": "max_duration", "mean": "mean_duration"
})
grouped.head()

SyntaxError: ignored

In [40]:
# Define the aggregation calculations
aggregations = {
    # work on the "duration" column
    'duration': { 
        # get the sum, and call this result 'total_duration'
        'total_duration': 'sum',  
        # get mean, call result 'average_duration'
        'average_duration': 'mean', 
        'num_calls': 'count'
    },
    # Now work on the "date" column
    'date': {     
        # Find the max, call the result "max_date" 
        'max_date': 'max',           
        'min_date': 'min',
        # Calculate the date range per group
        'num_days': lambda x: max(x) - min(x)  
    },
     # Calculate two results for the 'network' column with a list
    'network': ["count", "max"] 
}
# Perform groupby aggregation by "month", 
# but only on the rows that are of type "call"
df[df['item'] == 'call'].groupby('month').agg(aggregations)

SpecificationError: ignored